import random
print('โปรแกรมเป่ายิงฉุบ')
while True :
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(f'{a}')

    print('เลือก ค้อน กรรไกร กระดาษ')
    print('----------------------------')
    b = str(input('คุณเลือก : '))
    if b == "ค้อน" and a == "กรรไกร" :
        print('ผลลัพธ์คือ ชนะ')
        print('----------------------------\n')

    elif b == 'กรรไกร' and a == 'กระดาษ' :
        print('ผลลัพธ์คือ ชนะ')
        print('----------------------------\n')

    elif b == 'กระดาษ' and a == 'ค้อน' :
        print('ผลลัพธ์คือ ชนะ')
        print('----------------------------\n')

    elif b == a :
        print('ผลลัพธ์คือ เสมอ')
        print('----------------------------\n')

    else :
        print('ผลลัพธ์คือ แพ้')
        print('----------------------------\n')
    