print("โปรแกรมหาพื้นที่ 3 เหลี่ยม")
a = int(input('ใส่ค่าฐาน: '))
b = int(input('ใส่ค่าสูง: '))
c = 0.5 * a * b
print(f'ค่าพื้นที่ของ 3 เหลี่ยม = {c}\n')

print("โปรแกรมหาพื้นที่ 4 เหลี่ยมจัตุรัส")
a = int(input('ใส่ค่าด้าน: '))
c = a * a
print(f'ค่าพื้นที่ของ 4 เหลี่ยมจัตุรัส = {c}\n')

print("โปรแกรมหาพื้นที่ 4 เหลี่ยมผืนผ้า")
a = int(input('ใส่ค่ากว้าง: '))
b = int(input('ใส่ค่ายาว: '))
c = a * b 
print(f'ค่าพื้นที่ของ 4 เหลี่ยมผืนผ้า = {c}\n')

print("โปรแกรมหาพื้นที่ วงกลม")
p = 3.14
r = int(input('ใส่ค่ารัศมี: '))
c = p * r ** 2
print(f'ค่าพื้นที่ของ วงกลม = {c}\n')