name = (input("โปรดกรอกชื่อ \n"))
age = (input("โปรดกรอกอายุ\n"))
number = (input("โปรดกรอกรหัสประจำตัวนักศึกษา \n"))
a = (input("โปรดกรอกชั้นปี \n"))
nickname = (input("โปรดกรอกชื่อเล่น\n"))
h = int(input("โปรดกรอกส่วนสูง \n"))
w = int(input("โปรดกรอกน้ำหนัก \n"))
f = h + w

print("ชื่อ: " + name + "อายุ: " + age + " ปี")
print("รหัสประจำตัวนักศึกษา: " + number + "ระดับชั้น: " + a)
print("ชื่อเล่น: " + nickname)
print("ส่วนสูง: " + str(h) +" เซ็นติเมตร " + "น้ำหนัก: " + str(w) +(" กิโลกรัม"))
print("ส่วนสูง + น้ำหนัก = "+ str(f)) 
